{-5. Sabendo que [1..7] é equivalente à lista [1,2,3,4,5,6,7], complete as correspondências abaixo:
import Data.Char (ord,chr)

--(a) [’a’..’g’] =
-- Resposta : "abcdefg"

--(b) [0.1 ..0.9] =
-- Resposta : [0.1,1.1]

-- (c) [0.1,0.3 .. 0.9] =
-- Resposta :[0.1,0.3,0.5,0.7,0.8999999999999999]

-- (d) [0.1,0.3 ..1.8] =
-- Resposta :

-- (e) [0.4,0.2 ..0.8] =
-- Resposta : [0.1,0.3,0.5,0.7,0.8999999999999999,1.0999999999999999,1.3,1.5,1.7,1.9]

-- (f) [1,4..15]
-- Resposta : [1.4,2.4,3.4,4.4,5.4,6.4,7.4,8.4,9.4,10.4,11.4,12.4,13.4,14.4,15.4]


